a.org
**** *Define a Keybinding*
#+begin_src elisp
(global-set-key (kbd "C-c h") 'greet)  ;; Bind C-c h to the `greet` function
#+end_src
- =global-set-key= binds a key sequence to a function.

**** *Local Keybinding*
#+begin_src elisp
(define-key emacs-lisp-mode-map (kbd "C-c l") 'message)
#+end_src
- =define-key= binds a key in a specific mode.

---

*** *7. Hooks*
Hooks allow you to run code when certain events occur.

**** *Add a Hook*
#+begin_src elisp
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (message "Emacs Lisp mode activated!")))
#+end_src
- =add-hook= adds a function to a hook.

---

*** *8. Error Handling*
**** *Catch Errors*
#+begin_src elisp
(condition-case err
    (/ 1 0)  ;; Division by zero
  (error (message "Error: %s" err)))
#+end_src
- =condition-case= catches and handles errors.

---

*** *9. Example: Simple Calculator*
#+begin_src elisp
(defun simple-calculator ()
  "A simple calculator in Emacs Lisp."
  (interactive)
  (let ((x (read-number "Enter first number: "))
        (y (read-number "Enter second number: "))
        (op (read-char "Enter operator (+, -, *, /): ")))
    (message "Result: %d"
             (cond
              ((= op ?+) (+ x y))
              ((= op ?-) (- x y))
              ((= op ?*) (* x y))
              ((= op ?/) (/ x y))
              (t (error "Invalid operator"))))))

(simple-calculator)  ;; Run the calculator
#+end_src
- =interactive= makes the function callable with =M-x=.
- =let= binds local variables.
- =cond= is a multi-way conditional.

---

