a.html
<li><a id="1-0-8-1"></a><b>Define a Keybinding</b><br />
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">global-set-key</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">kbd</span> <span style="color: #98be65;">"C-c h"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">greet</span><span style="color: #51afef;">)</span>  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Bind C-c h to the `greet` function</span>
</pre>
</div>
<ul>
<li><code>global-set-key</code> binds a key sequence to a function.</li>

</ul>
</li>
<li><a id="1-0-8-2"></a><b>Local Keybinding</b><br />
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">define-key</span> <span style="color: #dcaeea;">emacs-lisp-mode-map</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">kbd</span> <span style="color: #98be65;">"C-c l"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">message</span><span style="color: #51afef;">)</span>
</pre>
</div>
<ul>
<li><code>define-key</code> binds a key in a specific mode.</li>

</ul>

<p>
&#x2014;
</p>
</li>
</ol>
</section>
<section id="slide-1-0-9">
<h4 id="1-0-9"><span class="section-number-4">1.0.9.</span> <b>7. Hooks</b></h4>
<p>
Hooks allow you to run code when certain events occur.
</p>
<ol class="org-ol">
<li><a id="1-0-9-1"></a><b>Add a Hook</b><br />
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">emacs-lisp-mode-hook</span>
          <span style="color: #c678dd;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #98be65;">()</span>
            <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Emacs Lisp mode activated!"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<ul>
<li><code>add-hook</code> adds a function to a hook.</li>

</ul>

<p>
&#x2014;
</p>
</li>
</ol>
</section>
<section id="slide-1-0-10">
<h4 id="1-0-10"><span class="section-number-4">1.0.10.</span> <b>8. Error Handling</b></h4>
<div class="outline-text-4" id="text-1-0-10">
</div>
<ol class="org-ol">
<li><a id="1-0-10-1"></a><b>Catch Errors</b><br />
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">condition-case</span> err
    <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">/</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span>  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Division by zero</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">error</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Error: %s"</span> err<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<ul>
<li><code>condition-case</code> catches and handles errors.</li>

</ul>

<p>
&#x2014;
</p>
</li>
</ol>
</section>
<section id="slide-1-0-11">
<h4 id="1-0-11"><span class="section-number-4">1.0.11.</span> <b>9. Example: Simple Calculator</b></h4>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">simple-calculator</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"A simple calculator in Emacs Lisp."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>x <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">read-number</span> <span style="color: #98be65;">"Enter first number: "</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
        <span style="color: #a9a1e1;">(</span>y <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">read-number</span> <span style="color: #98be65;">"Enter second number: "</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span>
        <span style="color: #a9a1e1;">(</span>op <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">read-char</span> <span style="color: #98be65;">"Enter operator (+, -, *, /): "</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Result: %d"</span>
             <span style="color: #a9a1e1;">(</span><span style="color: #51afef;">cond</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">=</span> op ?+<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">+</span> x y<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">=</span> op ?-<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">-</span> x y<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">=</span> op ?*<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">*</span> x y<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">=</span> op ?/<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">/</span> x y<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span>t <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">error</span> <span style="color: #98be65;">"Invalid operator"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>simple-calculator<span style="color: #51afef;">)</span>  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Run the calculator</span>
</pre>
</div>
<ul>
<li><code>interactive</code> makes the function callable with <code>M-x</code>.</li>
<li><code>let</code> binds local variables.</li>
<li><code>cond</code> is a multi-way conditional.</li>

</ul>

<p>
&#x2014;
</p>
</section>
