a.html
<section id="slide-5-0-5">
<h4 id="5-0-5"><span class="section-number-4">5.0.5.</span> which chinese companies are doing similar things to deepseek?</h4>
<p>
Several Chinese companies are actively working on advanced AI research and development, similar to DeepSeek. Here are some notable ones:
</p>

<ol>
<li><b>Baidu</b>:
<ul>
<li>Focus: AI, natural language processing, autonomous driving.</li>
<li>Key Projects: Baidu Brain, Apollo (autonomous driving platform), ERNIE (NLP model).</li>

</ul></li>

<li><b>Alibaba</b>:
<ul>
<li>Focus: AI for e-commerce, cloud computing, natural language processing.</li>
<li>Key Projects: Alibaba Cloud, DAMO Academy (AI research lab), AliGenie (voice assistant).</li>

</ul></li>

<li><b>Tencent</b>:
<ul>
<li>Focus: AI for gaming, social media, healthcare.</li>
<li>Key Projects: Tencent AI Lab, WeChat AI, medical imaging AI.</li>

</ul></li>

<li><b>SenseTime</b>:
<ul>
<li>Focus: Computer vision, facial recognition, AI for smart cities.</li>
<li>Key Projects: SenseFoundry (AI platform for urban management), SenseMARS (mixed reality platform).</li>

</ul></li>

<li><b>iFlytek</b>:
<ul>
<li>Focus: Speech recognition, natural language processing, AI for education.</li>
<li>Key Projects: iFlytek Input, AI-powered educational tools, voice assistants.</li>

</ul></li>

<li><b>Megvii</b>:
<ul>
<li>Focus: Computer vision, facial recognition, AI for IoT.</li>
<li>Key Projects: Face++ (facial recognition platform), Brain++ (AI platform).</li>

</ul></li>

<li><b>Huawei</b>:
<ul>
<li>Focus: AI for telecommunications, cloud computing, AI chips.</li>
<li>Key Projects: Ascend AI processors, Huawei Cloud, AI research in its Noah&rsquo;s Ark Lab.</li>

</ul></li>

</ol>

<p>
These companies are at the forefront of AI innovation in China, contributing to advancements in various domains and pushing the boundaries of what AI can achieve.
</p>
</section>
<section id="slide-5-0-6">
<h4 id="5-0-6"><span class="section-number-4">5.0.6.</span> can you give me a list of company working on AI and LLM, and located in Beijing or Shenzhen?</h4>
<p>
Here’s a list of notable companies working on AI and large language models (LLMs) located in <b>Beijing</b> or <b>Shenzhen</b>:
</p>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-7">
<h4 id="5-0-7"><span class="section-number-4">5.0.7.</span> <b>Beijing</b>:</h4>
<ol>
<li><b>Baidu</b>:
<ul>
<li>Focus: AI, NLP, autonomous driving, LLMs.</li>
<li>Key Projects: ERNIE (LLM), Baidu Brain, Apollo (autonomous driving).</li>

</ul></li>

<li><b>ByteDance</b>:
<ul>
<li>Focus: AI for content recommendation, NLP, LLMs.</li>
<li>Key Projects: TikTok recommendation algorithms, AI-powered content creation tools.</li>

</ul></li>

<li><b>Megvii</b>:
<ul>
<li>Focus: Computer vision, facial recognition, AI for IoT.</li>
<li>Key Projects: Face++ (facial recognition), Brain++ (AI platform).</li>

</ul></li>

<li><b>DeepSeek</b>:
<ul>
<li>Focus: AGI, LLMs, AI research.</li>
<li>Key Projects: DeepSeek Chat, AI for scientific research.</li>

</ul></li>

<li><b>Horizon Robotics</b>:
<ul>
<li>Focus: AI chips, edge AI, autonomous driving.</li>
<li>Key Projects: AI processors for smart devices and vehicles.</li>

</ul></li>

<li><b>iFlytek</b>:
<ul>
<li>Focus: Speech recognition, NLP, AI for education.</li>
<li>Key Projects: iFlytek Input, AI-powered educational tools.</li>

</ul></li>

<li><b>Biren Technology</b>:
<ul>
<li>Focus: AI chips, GPU development for AI workloads.</li>
<li>Key Projects: GPUs for AI training and inference.</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-8">
<h4 id="5-0-8"><span class="section-number-4">5.0.8.</span> <b>Shenzhen</b>:</h4>
<ol>
<li><b>Tencent</b>:
<ul>
<li>Focus: AI for gaming, social media, NLP, LLMs.</li>
<li>Key Projects: WeChat AI, Tencent AI Lab, Hunyuan (LLM).</li>

</ul></li>

<li><b>Huawei</b>:
<ul>
<li>Focus: AI for telecommunications, cloud computing, AI chips.</li>
<li>Key Projects: Ascend AI processors, Huawei Cloud, Pangu (LLM).</li>

</ul></li>

<li><b>DJI</b>:
<ul>
<li>Focus: AI for drones, computer vision, robotics.</li>
<li>Key Projects: AI-powered drone navigation and imaging.</li>

</ul></li>

<li><b>SenseTime</b>:
<ul>
<li>Focus: Computer vision, facial recognition, AI for smart cities.</li>
<li>Key Projects: SenseFoundry, SenseMARS.</li>

</ul></li>

<li><b>CloudWalk</b>:
<ul>
<li>Focus: Facial recognition, AI for finance and security.</li>
<li>Key Projects: AI-powered identity verification systems.</li>

</ul></li>

<li><b>UBTech</b>:
<ul>
<li>Focus: AI for robotics, humanoid robots, NLP.</li>
<li>Key Projects: AI-powered service robots.</li>

</ul></li>

<li><b>Zhipu AI</b>:
<ul>
<li>Focus: LLMs, NLP, AI research.</li>
<li>Key Projects: GLM (General Language Model).</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>

<p>
These companies are leading the charge in AI and LLM development in China, with significant contributions to both research and practical applications.
</p>
</section>
<section id="slide-5-0-9">
<h4 id="5-0-9"><span class="section-number-4">5.0.9.</span> can you explain how the limitations of access to CUDA gpu chips ( due to embargo from the US ) impacted deepseek development approach?</h4>
<p>
The U.S. embargo on advanced CUDA-capable GPUs, particularly those from NVIDIA (e.g., A100, H100), has significantly impacted AI development in China, including companies like <i>DeepSeek</i>. Here’s how these limitations have influenced DeepSeek&rsquo;s development approach:
</p>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-10">
<h4 id="5-0-10"><span class="section-number-4">5.0.10.</span> 1. <b>Shift to Alternative Hardware</b>:</h4>
<ul>
<li><b>Domestic GPUs</b>: DeepSeek has likely turned to Chinese-made GPUs, such as those from <i>Biren Technology</i> or <i>Moore Threads</i>, which are designed to compete with NVIDIA&rsquo;s offerings. These GPUs may not match NVIDIA&rsquo;s performance but are increasingly viable for AI workloads.</li>
<li><b>AI Accelerators</b>: Companies like <i>Huawei</i> (with Ascend chips) and <i>Cambricon</i> provide AI-specific accelerators that can be used for training and inference, reducing reliance on CUDA.</li>

</ul>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-11">
<h4 id="5-0-11"><span class="section-number-4">5.0.11.</span> 2. <b>Optimization for Non-CUDA Frameworks</b>:</h4>
<ul>
<li>DeepSeek may have adapted its AI frameworks to work with non-CUDA ecosystems, such as Huawei&rsquo;s <i>MindSpore</i> or open-source alternatives like <i>PyTorch</i> with ROCm (AMD&rsquo;s open software platform).</li>
<li>This requires significant engineering effort to optimize models for different hardware architectures.</li>

</ul>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-12">
<h4 id="5-0-12"><span class="section-number-4">5.0.12.</span> 3. <b>Focus on Efficiency</b>:</h4>
<ul>
<li>With limited access to high-performance GPUs, DeepSeek likely prioritizes model efficiency, such as:
<ul>
<li><b>Model Compression</b>: Techniques like quantization, pruning, and distillation to reduce computational requirements.</li>
<li><b>Sparse Training</b>: Leveraging sparsity in neural networks to reduce resource usage.</li>
<li><b>Smaller Models</b>: Developing smaller, more efficient LLMs that can achieve competitive performance with fewer resources.</li>

</ul></li>

</ul>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-13">
<h4 id="5-0-13"><span class="section-number-4">5.0.13.</span> 4. <b>Distributed Computing</b>:</h4>
<ul>
<li>DeepSeek may rely more on distributed computing across clusters of less powerful GPUs or CPUs to compensate for the lack of high-end GPUs.</li>
<li>This approach requires robust infrastructure and software to manage distributed training effectively.</li>

</ul>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-14">
<h4 id="5-0-14"><span class="section-number-4">5.0.14.</span> 5. <b>Collaboration with Domestic Tech Giants</b>:</h4>
<ul>
<li>DeepSeek could partner with companies like <i>Huawei</i>, <i>Baidu</i>, or <i>Tencent</i>, which have invested heavily in domestic AI hardware and software ecosystems.</li>
<li>These collaborations provide access to alternative resources and expertise.</li>

</ul>

<p>
&#x2014;
</p>
</section>
<section id="slide-5-0-15">
<h4 id="5-0-15"><span class="section-number-4">5.0.15.</span> 6. <b>Long-Term Investment in Domestic AI Ecosystem</b>:</h4>
<ul>
<li>The embargo has likely accelerated DeepSeek&rsquo;s investment in China&rsquo;s domestic AI ecosystem, including:
<ul>
<li>Developing proprietary AI chips or collaborating with local chipmakers.</li>
<li>Contributing to open-source frameworks that are hardware-agnostic.</li>

</ul></li>

</ul>

<p>
&#x2014;
</p>
</section>
