a.html
<section>
<section id="slide-11">
<h2 id="11"><span class="section-number-2">11.</span> yolo run :</h2>
<ul>
<li>you try on a small number of GPU, and after a while you have to yolo and go big.</li>
<li>yolo run are cheaper in post-training runs.</li>

</ul>
<p>
Translate that in mandarin chinese please
</p>

<p>
YOLO 运行：
</p>
<ul>
<li>你先在少量 GPU 上尝试，过一段时间后就得 YOLO（放手一搏）并加大规模。</li>
<li>YOLO 运行在训练后的运行中更便宜。</li>

</ul>

<p>
翻译成中文（简体）：
YOLO 运行：
</p>
<ul>
<li>你先在少量 GPU 上尝试，过一段时间后就得放手一搏并加大规模。</li>
<li>YOLO 运行在训练后的运行中成本更低。</li>

</ul>

<p>
<b>*</b>
</p>
</section>
</section>
<section>
<section id="slide-12">
<h2 id="12"><span class="section-number-2">12.</span> OpenAi went yolo on MoE in 2022.</h2>
</section>
</section>
<section>
<section id="slide-13">
<h2 id="13"><span class="section-number-2">13.</span> Can you explain how DeepSeek approach to MoE is different from OpenAi&rsquo;s?</h2>
<p>
DeepSeek&rsquo;s approach to <b>Mixture of Experts (MoE)</b> differs from OpenAI&rsquo;s in several key ways:
</p>

<p>
&#x2014;
</p>

<ol>
<li><i>Expert Selection</i>:
<ul>
<li><b>OpenAI</b>: Uses a fixed, predefined routing mechanism (e.g., top-k routing) to select experts for each input.</li>
<li><b>DeepSeek</b>: Implements a dynamic routing mechanism that adapts to the input, potentially improving efficiency and performance.</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>

<ol>
<li><i>Scalability</i>:
<ul>
<li><b>OpenAI</b>: Focuses on scaling MoE models for large-scale tasks, often requiring massive computational resources.</li>
<li><b>DeepSeek</b>: Emphasizes resource efficiency, optimizing MoE for smaller-scale or specialized tasks without sacrificing performance.</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>

<ol>
<li><i>Training Stability</i>:
<ul>
<li><b>OpenAI</b>: Addresses loss spikes and instability through techniques like gradient clipping and learning rate scheduling.</li>
<li><b>DeepSeek</b>: Introduces novel stabilization methods, such as adaptive expert load balancing, to reduce training instability.</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>

<ol>
<li><i>Use Cases</i>:
<ul>
<li><b>OpenAI</b>: Primarily applies MoE to general-purpose language models (e.g., GPT variants).</li>
<li><b>DeepSeek</b>: Targets domain-specific applications, tailoring MoE architectures to specific industries or tasks.</li>

</ul></li>

</ol>

<p>
&#x2014;
</p>

<p>
In summary, while OpenAI focuses on large-scale, general-purpose MoE models, DeepSeek prioritizes efficiency, adaptability, and domain-specific optimization.
</p>
</section>
<section id="slide-13-0-1">
<h4 id="13-0-1"><span class="section-number-4">13.0.1.</span> i have heard something like Deepseek having more activated experts at any one time, or maybe was it a higher activation rate, can you explain that?</h4>
<p>
<b>*</b>
During large LLM training, I heard there are moments when coordination between gpu is required. I heard the terms &ldquo; all reduce&rdquo;, &ldquo;all gather&rdquo;. give me some backgroud
</p>
</section>
<section id="slide-13-0-2">
<h4 id="13-0-2"><span class="section-number-4">13.0.2.</span> DeepSeek&rsquo;s Higher Activation Rate in MoE:</h4>
<p>
DeepSeek&rsquo;s approach to /Mixture of Experts (MoE)* often involves activating <b>more experts per input</b> compared to OpenAI&rsquo;s typical top-k routing (e.g., top-2). Here&rsquo;s what that means:
</p>

<ul>
<li><i>OpenAI</i>: Usually activates a small, fixed number of experts (e.g., 2 out of many) for each input token.</li>
<li><i>DeepSeek</i>: May activate a <b>higher number of experts</b> (e.g., 4 or more) or use a <b>higher activation rate</b>, meaning more experts contribute to processing each input.</li>

</ul>
<ol class="org-ol">
<li><a id="13-0-2-1"></a>Why This Matters:<br />
<ol>
<li><i>Better Representation</i>: Activating more experts allows the model to capture more nuanced patterns in the data.</li>
<li><i>Flexibility</i>: A higher activation rate can adapt better to complex or diverse inputs.</li>
<li><i>Trade-off</i>: While this improves performance, it also increases computational cost and communication overhead.</li>

</ol>

<p>
Deepseek approach to MoE.
Usually MoE is done with 8 to 16 experts, with 2 activated .
This approach is what allowed Mixtral and others to make leaps.
DeepSeek
</p>
</li>
</ol>
</section>
<section id="slide-13-0-3">
<h4 id="13-0-3"><span class="section-number-4">13.0.3.</span> Coordination in Large LLM Training:</h4>
<p>
During distributed training of large LLMs, GPUs need to synchronize their computations. Two key operations are <b>&ldquo;all-reduce&rdquo;</b> and <b>&ldquo;all-gather&rdquo;</b>:
</p>

<ol>
<li><i>All-Reduce</i>:
<ul>
<li><b>Purpose</b>: Combines (e.g., sums) data across all GPUs and distributes the result back to each GPU.</li>
<li><b>Use Case</b>: Used in gradient synchronization during backpropagation.</li>
<li><b>Example</b>: Each GPU computes a gradient, and <code>all-reduce</code> ensures all GPUs have the same averaged gradient for weight updates.</li>

</ul></li>

<li><i>All-Gather</i>:
<ul>
<li><b>Purpose</b>: Collects data from all GPUs and distributes the combined data to each GPU.</li>
<li><b>Use Case</b>: Used when GPUs need to share information, such as embeddings or intermediate results.</li>
<li><b>Example</b>: Each GPU holds a part of a large tensor, and <code>all-gather</code> combines them into a full tensor on all GPUs.</li>

</ul></li>

</ol>
<p>
Apart from all-reduces and all-gather
</p>
<ol class="org-ol">
<li><a id="13-0-3-1"></a>Why Coordination Matters:<br />
<ul>
<li><i>Consistency</i>: Ensures all GPUs work with the same data, maintaining model consistency.</li>
<li><i>Scalability</i>: Enables training on massive datasets by distributing workloads across many GPUs.</li>
<li><i>Bottleneck</i>: These operations can become communication bottlenecks, especially in large-scale training.</li>

</ul>

<p>
&#x2014;
</p>

<p>
In summary:
</p>
<ul>
<li>DeepSeek&rsquo;s higher activation rate in MoE allows for richer input processing but increases computational demands.</li>
<li><p>
Coordination operations like <code>all-reduce</code> and <code>all-gather</code> are critical for synchronizing distributed training across GPUs.
</p>

<p>
8 out of 256 experts.
</p></li>

</ul>
</li>
</ol>
</section>
</section>
<section>
<section id="slide-14">
<h2 id="14"><span class="section-number-2">14.</span> can you give me an analogy for the MoE approach?</h2>
<p>
The Mixture of Experts (MoE) approach can be likened to a team of specialists in a hospital. Each doctor (expert) specializes in a specific area (e.g., cardiology, neurology). When a patient (input) arrives, a gating mechanism (like a triage nurse) decides which specialist(s) should handle the case based on the patient&rsquo;s symptoms. The selected specialists then collaborate to provide a diagnosis or treatment (output). This way, the system leverages the strengths of each expert, rather than relying on a single generalist.
</p>

<p>
<b>*</b>
</p>
</section>
</section>
<section>
<section id="slide-15">
<h2 id="15"><span class="section-number-2">15.</span> how would you define &ldquo;sparsity factor&rdquo; in the context of LLM MoE training?</h2>

</section>
</section>
