a.html
<section>
<section id="slide-16">
<h2 id="16"><span class="section-number-2">16.</span> I heard a AI specialist saying that in the Mixture of Expert literature there is something known as the auxiliary loss to balance the participation of experts. Can you tell me more about that term?</h2>
<ol>
<li><b>Sparsity Factor in LLM MoE Training</b>:
The sparsity factor refers to the proportion of experts that are activated for a given input in a Mixture of Experts (MoE) model. In MoE, only a small subset of experts (e.g., 1 or 2) is typically activated per input, making the model computationally efficient. The sparsity factor is the ratio of active experts to the total number of experts, often kept low (e.g., 1/8 or 1/16) to maintain efficiency.</li>

<li><p>
<b>Auxiliary Loss in MoE</b>:
The auxiliary loss is a regularization term added to the training objective to encourage balanced expert participation. Without it, some experts might be underutilized. A common form is the &ldquo;load balancing loss,&rdquo; which penalizes uneven expert usage, ensuring all experts contribute meaningfully. This helps prevent mode collapse and improves model performance.
</p>

<p>
Data
Architecture DeepSeek shared architecture and training. Their low level load balancing to coordinate 32 experts is something that they are the first to figure out publicly. You could say that maybe 1 or 2 cother companies have been able to that before, but even that is not even sure.
Post-training
</p></li>

</ol>

<p>
<b>*</b>
Is it fair to say the the current LLM architecture, even with mixture of experts, is limited. I mean: if I ask a model how many &ldquo;2&rdquo; are in straberry and it gets it wrong, than clearly there is something wrong. The core math and logic is not part of the model training, and so I conclude that LLM will not be the models that will win the race.
Please give me your opinion about that point, thank you
</p>

<p>
Your observation touches on a key limitation of current LLMs. While they excel at pattern recognition and generating coherent text, they lack inherent reasoning and mathematical capabilities. Models like GPT-4 rely on statistical patterns in training data rather than explicit logic or symbolic reasoning. This is why they can struggle with tasks requiring precise counting, arithmetic, or logical deduction.
</p>

<p>
Mixture of Experts (MoE) improves efficiency and specialization but doesn&rsquo;t fundamentally address this limitation. LLMs are not designed to perform tasks requiring formal reasoning or exact computation, as their training is based on predicting the next token rather than understanding underlying rules.
</p>

<p>
However, LLMs are still powerful tools for many applications, especially when combined with external systems (e.g., calculators, symbolic solvers). The &ldquo;winning&rdquo; models of the future may integrate neural approaches with symbolic reasoning, bridging the gap between pattern recognition and logical rigor. So while LLMs alone may not &ldquo;win the race,&rdquo; they could be a key component of more advanced hybrid systems.
</p>

<p>
<b>*</b>
</p>
</section>
</section>
<section>
<section id="slide-17">
<h2 id="17"><span class="section-number-2">17.</span> the bitter lesson essentially says that the type of training that will win out are scalable in learning and search.</h2>
<p>
My son is 8 yo and homeschooled, and i have problem with his behavior. should I punish him and prevent him from going to his hobbies?
</p>


<p>
Focus on understanding the root cause of the behavior rather than punitive measures. Consider these steps:
</p>
<ol>
<li><b>Connect first</b>: Address emotional needs - homeschool can be socially isolating.</li>
<li><b>Clear expectations</b>: Create consistent routines/rules <span class="underline">with</span> him, not just <span class="underline">for</span> him.</li>
<li><b>Natural consequences</b>: Tie consequences directly to actions (e.g., &ldquo;If schoolwork isn&rsquo;t finished by noon, park time shifts to after completion&rdquo;).</li>
<li><b>Preserve hobbies</b>: These are crucial for motivation and emotional regulation.</li>

</ol>

<p>
For specific strategies, <b>&ldquo;How to Talk So Kids Will Listen&rdquo;</b> (Faber/Mazlish) offers practical communication tools. Would you like guidance on implementing positive discipline techniques?
</p>
</section>
<section id="slide-17-0-1">
<h4 id="17-0-1"><span class="section-number-4">17.0.1.</span> I have been using deepseek api over the last month, and there seems to have changes among the models that are now avaible, for example it seems that deepseek-coder is gone. Could you list the models that are currently available for api calls?</h4>
<p>
As of my knowledge cutoff in October 2023, I don&rsquo;t have real-time access to DeepSeek&rsquo;s API or its model updates. However, you can check the latest available models by:
</p>

<ol>
<li>Visiting the official DeepSeek API documentation.</li>
<li>Using their API endpoint to list available models (if supported).</li>
<li>Contacting their support team for the most accurate and up-to-date information.</li>

</ol>

<p>
If you share the API documentation or specific details, I can help interpret or guide you further!
</p>
</section>
</section>
<section>
<section id="slide-18">
<h2 id="18"><span class="section-number-2">18.</span> can you explain what is LSTM long shot term memory and how it differs from Transformer</h2>
<p>
<b>*LSTM (Long Short-Term Memory):</b>
A type of Recurrent Neural Network (RNN) designed to handle long-term dependencies. Uses <b>gates</b> (input, forget, output) to regulate information flow via a cell state, mitigating vanishing gradients in traditional RNNs. Processes data <b>sequentially</b> (step-by-step).
</p>

<p>
<b>Transformers:</b>
Rely on <b>self-attention</b> to process all sequence elements in parallel. Use <b>positional encodings</b> for order information. No recurrence; scales efficiently with modern hardware.
</p>

<p>
<b>Key Differences:</b>
</p>
<ol>
<li><b>Processing:</b> Sequential (LSTM) vs. parallel (Transformers).</li>
<li><b>Mechanism:</b> Gates vs. self-attention.</li>
<li><b>Long-range context:</b> Transformers handle distant dependencies better via direct attention links.</li>
<li><b>Speed:</b> Transformers train faster (parallelization).</li>
<li><b>Data:</b> Transformers typically require more data but scale better.</li>
<li><b>Order handling:</b> LSTMs implicitly capture sequence order; Transformers require explicit positional encodings.</li>

</ol>

<p>
Transformers dominate modern NLP (e.g., GPT, BERT), while LSTMs are less common post-2017.
</p>
</section>
<section id="slide-18-0-1">
<h4 id="18-0-1"><span class="section-number-4">18.0.1.</span> have you heard about the latest version of LSTM, it is called xLSTM ( NX-AI )? if yes what can you tell me about them?</h4>
<p>
Yes! <b>xLSTM</b> (from the <b>NX-AI</b> research group) is a recent extension of traditional LSTM architectures, designed to address key limitations of both classic LSTMs and Transformers. Here’s what’s known so far:
</p>
</section>
<section id="slide-18-0-2">
<h4 id="18-0-2"><span class="section-number-4">18.0.2.</span> <b>Key Features of xLSTM</b> (2024):</h4>
<ol>
<li><b>Exponential Gating</b>
<ul>
<li>Replaces traditional sigmoid gates with <i>exponential activation functions</i> to improve gradient flow and enable more stable training over very long sequences.</li>
<li>Mitigates the &ldquo;vanishing gradient&rdquo; issue more effectively than classic LSTMs.</li>

</ul></li>
<li><b>Matrix Memory</b>
<ul>
<li>Uses a <i>matrix-based cell state</i> (instead of a vector) to store richer contextual information.</li>
<li>Allows for parallelizable operations and better modeling of complex dependencies.</li>

</ul></li>

<li><b>Parallel Training</b>
<ul>
<li>Unlike classic LSTMs (sequential by design), xLSTM introduces <b>grouped processing</b> to enable partial parallelization during training.</li>
<li>Reduces training time while retaining sequential inductive bias.</li>

</ul></li>

<li><b>Scalability</b>
<ul>
<li>Combines the efficiency of LSTMs with the scalability of Transformers.</li>
<li>Claims competitive performance on large language tasks (e.g., language modeling) with fewer parameters.</li>

</ul></li>

</ol>
</section>
